UTAF_Base/requestFiles/PFB_CheckCreditWorthiness.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://api.web.bc/api/schema/commoncontext/v2" xmlns:v1="http://api.web.bc/api/schema/commoncontext/transaction/v1" xmlns:v11="http://api.web.bc/api/schema/commoncontext/consumertransaction/v1" xmlns:v12="http://api.web.bc/capability/business/b280-01/services/checkfinancialbackground/flv000340/v1" xmlns:v13="http://api.web.bc/capability/business/b280-01/objects/requestcheckcreditworthiness/flv000340/v1">
   <soapenv:Header>
      <v2:CommonContextRequest>
         <v2:transaction>
            <v1:messageId>${Req_corrId}</v1:messageId>
            <v1:correlationId>${Req_corrId}</v1:correlationId>
         </v2:transaction>
      </v2:CommonContextRequest>
   </soapenv:Header>
   <soapenv:Body>
      <v12:RequestDataCheckCreditWorthiness>
         <v12:serviceContext>
         <v12:scoping>
               <v13:codeSystem>${Req_scopin_codeSystem}</v13:codeSystem>
               <v13:codeDescription>${Req_scopin_codeDescription}</v13:codeDescription>
               <v13:value>${Req_scopin_value}</v13:value>
            </v12:scoping>
            <v12:transactionData>
               <v12:endUserId>ID867940</v12:endUserId>
               <v12:endUserLanguage>EN</v12:endUserLanguage>
               <v12:consumerApplication>PFB</v12:consumerApplication>
            </v12:transactionData>
         </v12:serviceContext>
         <v12:serviceData>
            <v12:criteria>
			<v12:customerIdentifier>
                  <v13:id>${Req_custId}</v13:id>
                  <v13:idScope>
                     <v13:value>${Req_custId_idScope}</v13:value>
                  </v13:idScope>
                  <v13:idContext>
                     <v13:value>${Req_custId_idContext}</v13:value>
                  </v13:idContext>
               </v12:customerIdentifier>
			<v12:identifier>
                  <v13:id>${Req_partyId}</v13:id>
                  <v13:idScope>
                      <v13:value>${Req_idScope}</v13:value>
                   </v13:idScope>
                  <v13:idContext>
                     <v13:value>${Req_idContext}</v13:value>
                   </v13:idContext>
               </v12:identifier>
               <v12:VATNumber>
                  <v13:countryCode>
                     <v13:alpha2Code>${Req_VAT_countryCode}</v13:alpha2Code>
                  </v13:countryCode>
                  <v13:VATNumber>${Req_VATNumber}</v13:VATNumber>
               </v12:VATNumber>
            </v12:criteria>
         </v12:serviceData>
      </v12:RequestDataCheckCreditWorthiness>
   </soapenv:Body>
</soapenv:Envelope>